README.md

# Table of Contents

1.  [Nome do Software (ou Biblioteca):](#org89542e3)
2.  [Resumo e/ou informação extra:](#org4fb5e5f)
3.  [Versão:](#orgfb149dd)
4.  [Data:](#org1c4e82e)
5.  [Autor de Contato:](#orgba8aaad)
6.  [Lista dos Autores:](#orgd148a78)
7.  [Áreas de pesquisa vinculadas:](#org427a8cd)
8.  [Vinculo com:](#orgfbd47de)
9.  [Paradigmas:](#orgd89f651)
10. [Tipo de Interface:](#org0f00ffd)
11. [Plataformas Suportadas:](#orgd8f9001)
12. [Linguagens Utilizadas:](#org05770e9)
13. [Bibliotecas Utilizadas (dependências):](#orga8ff96c)
14. [Softwares utilizados (dependências)](#org71c498c)
15. [Tipo de Licença:](#org348aa12)
16. [Links:](#org0fb3c78)


<a id="org89542e3"></a>

# Nome do Software (ou Biblioteca):

-   Simulador de Propriedades Mecânicas de Material Submetido ao Processo de Corrosão por Dióxido de Carbono.
-   Desenvolver um programa que receba dados reais ou arbitrários e calcule as propriedades mecânicas do material a partir de onde serão gerados gráficos

que poderão ser utilizados para análise de taxas corrosivas.

-   ProjetoEngenharia-SimuladorPropriedadesMaterialSubmetidoCorrosaoPorDioxidoDeCarbono


<a id="org4fb5e5f"></a>

# Resumo e/ou informação extra:

-   Desenvolver um programa que receba dados reais ou arbitrários e calcule as

propriedades mecânicas do material a partir de onde serão gerados gráficos
que poderão ser utilizados para análise de taxas corrosivas.


<a id="orgfb149dd"></a>

# Versão:

-   1.0.


<a id="org1c4e82e"></a>

# Data:

-   2015/2 - segundo semestre.


<a id="orgba8aaad"></a>

# Autor de Contato:

-   André Duarte Bueno <andreduartebueno@gmail.com>


<a id="orgd148a78"></a>

# Lista dos Autores:

-   THAYNÁ ANGELO DOS REIS
-   André Duarte Bueno <andreduartebueno@gmail.com>


<a id="org427a8cd"></a>

# Áreas de pesquisa vinculadas:

-   Modelagem Matemática Computacional
-   Corrosão


<a id="orgfbd47de"></a>

# Vinculo com:

-   Trabalho da disciplina de programação prática.


<a id="orgd89f651"></a>

# Paradigmas:

-   POO - Programação Orientada a Objeto (códigos em C++)


<a id="org0f00ffd"></a>

# Tipo de Interface:

-   Terminal e gráfica (gnuplot).


<a id="orgd8f9001"></a>

# Plataformas Suportadas:

-   Windows e GNU/Linux e Mac OS X (não testada).


<a id="org05770e9"></a>

# Linguagens Utilizadas:

-   C++ 11.


<a id="orga8ff96c"></a>

# Bibliotecas Utilizadas (dependências):

-   CGnuplot - <https://github.com/ldsc/CGnuplot>


<a id="org71c498c"></a>

# Softwares utilizados (dependências)

-   gnuplot <http://www.gnuplot.info/>


<a id="org348aa12"></a>

# Tipo de Licença:

-   GPL
-   Entre em contato com o Prof. André Duarte Bueno
    andreduartebueno@gmail.com
    para que o mesmo gere um novo projeto no github do ldsc para que você (e sua equipe) possam trabalhar na nova versão.
-   Se este projeto tem como número de versão 1.0 a nova versão deverá ser 2.0 e assim sucessivamente.
-   Os nomes dos autores originais deve ser preservada na nova versão, ou seja, adicione a informação do número da versão, os nomes dos membros da nova equipe, mas jamais apague os nomes dos autores originais (isto seria plágio).
-   Na descrição do projeto informe que trata-se de uma nova versão, que tem como base a versão anterior e DESTAQUE COM CLAREZA E OBJETIVIDADE QUAIS AS NOVIDADES DA NOVA VERSÃO.


<a id="org0fb3c78"></a>

# Links:

